app/controllers/uploads_controller.rb

  def index
    @uploads = Upload.all
---
SELECT "uploads".* FROM "uploads"

  def create
    @upload = Upload.new(upload_params)

    respond_to do |format|
      if @upload.save
---
INSERT INTO "uploads" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Beck - Sony Studios"], ["description", "Awesome"], ["created_at", 2016-07-09 01:37:47 UTC], ["updated_at", 2016-07-09 01:37:47 UTC]]

  def destroy
    @upload.destroy
---
DELETE FROM "uploads" WHERE "uploads"."id" = ?  [["id", 2]]

    def set_upload
      @upload = Upload.find(params[:id])
---
SELECT  "uploads".* FROM "uploads" WHERE "uploads"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]